; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation12 - direction
	Star13 - direction
	Star11 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star7 - direction
	Star5 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star11)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star11)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite1 Star1)
	(pointing satellite2 Star19)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 spectrograph0)
	(have_image Star16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Phenomenon18 spectrograph1)
	(have_image Star19 spectrograph1)
))

)

; plan
1. (turn_to satellite2 groundstation3 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite2 star15 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star15)
   goals met: 0 of 9
5. (take_image satellite2 star15 instrument3 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon18 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 phenomenon18)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon18 instrument3 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon14 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 9
9. (turn_to satellite0 star10 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star10)
   goals met: 3 of 9
10. (take_image satellite2 phenomenon14 instrument3 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 4 of 9
11. (turn_to satellite1 star1 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star1)
   goals met: 5 of 9
12. (turn_to satellite2 star16 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star16)
   goals met: 5 of 9
13. (take_image satellite2 star16 instrument3 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 6 of 9
14. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 6 of 9
15. (take_image satellite2 star17 instrument3 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 7 of 9
16. (turn_to satellite2 star19 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star19)
   goals met: 8 of 9
17. (take_image satellite2 star19 instrument3 spectrograph1)
   added: (have_image star19 spectrograph1)
   goals met: 9 of 9
